Autodesk.Revit.DB.NumberingFormatSettings.RemoveParameter(System.Int32)
Remove a parameter from a specific index.
The position where the parameter to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The parameters container must not be empty. The provided index is index
-or-
index must be in range between 0 and NumberOfParameters.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.SetParameter(Autodesk.Revit.DB.NumberingFormattedParameter,System.Int32)
Set parameter incorporated into the numeric label.
Parameter to be added into the label
The position where the parameter to be added
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index must be in range between 0 and NumberOfParameters, including margins
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.SetParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.NumberingFormattedParameter})
Set parameters incorporated into the numeric label.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.GetParameter(System.Int32)
Get the parameter at the provided index incorporated into the numeric label.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
index must be in range between 0 and NumberOfParameters.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.GetParameters
Get parameters incorporated into the numeric label.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.NumberingFormatSettings.NumberOfParameters
A property defining the number of parameters used in this formatting settings object.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.FirstNumberFormattingOption
The formatting options for the start of a sequence.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.UppercaseCharacters
if asCharacters is enabled, the characters will be presented as uppercase.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.AsCharacters
True if the number is using characters, false for digits.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.MinimumNumberOfDigits
Defines the minimum digit count for the numerical display.
Remarks:
This is not applied when numbering uses characters instead of digits.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: minimumNumberOfDigits must be in range between 1 and 10.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.#ctor
Create an empty NumberingFormatSettings object.
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings.#ctor(Autodesk.Revit.DB.NumberingFormatSettings)
Copy a parameter and its association.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.NumberingFormatSettings
Settings associated with the formatting of a numbering schema.
Remarks:
This object contains all the formatting settings related to a numbering schema.
The final number available on the element is generated for the user based on the parameters set with
GetParameters/SetParameters on this object.
The order for this parameter is the order in which their values will appear in the generated number.
All the transformations applied to this values that are available are controlled from the NumberingFormattedParameter set with the above methods.
The value assigned by the system will have the position of the parameter with the same id as the NumberingParameterId on the NumberingSchema.
The AsCharacters property controls if in the final output the value assigned by the system will be presented
as a set of letter(ex A for 1, B for 2, AA for 20)
The MinimumNumberOfDigits property determines the minimum number of digits that will be used for the
value assigned for the system if AsCharacters is false.
Since:
2027